Hybrid-Memcached/ex3_result/memtier_16t_16t_default_datasize_50_cycle_10_result
16        Threads
50        Connections per thread
60        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       150194.08          ---          ---         5.31800         5.69500        11.96700        18.81500     13347.33 
Gets          145.58       145.58         0.00         5.19343         5.59900        11.77500        18.04700        15.92 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     150339.66       145.58         0.00         5.31788         5.69500        11.96700        18.81500     13363.25 


Request Latency Distribution
Type     <= msec         Percent
------------------------------------------------------------------------
SET       0.103        0.000
SET       3.375        5.000
SET       3.503       10.000
SET       3.599       15.000
SET       3.679       20.000
SET       3.775       25.000
SET       3.871       30.000
SET       4.031       35.000
SET       4.511       40.000
SET       5.471       45.000
SET       5.695       50.000
SET       5.791       52.500
SET       5.823       55.000
SET       5.887       57.500
SET       5.951       60.000
SET       5.983       62.500
SET       6.015       65.000
SET       6.079       67.500
SET       6.111       70.000
SET       6.175       72.500
SET       6.207       75.000
SET       6.239       76.250
SET       6.271       77.500
SET       6.303       78.750
SET       6.335       80.000
SET       6.367       81.250
SET       6.431       82.500
SET       6.463       83.750
SET       6.527       85.000
SET       6.591       86.250
SET       6.655       87.500
SET       6.687       88.125
SET       6.751       88.750
SET       6.783       89.375
SET       6.847       90.000
SET       6.879       90.625
SET       6.943       91.250
SET       7.007       91.875
SET       7.071       92.500
SET       7.135       93.125
SET       7.199       93.750
SET       7.263       94.062
SET       7.295       94.375
SET       7.327       94.688
SET       7.391       95.000
SET       7.423       95.312
SET       7.487       95.625
SET       7.551       95.938
SET       7.615       96.250
SET       7.679       96.562
SET       7.775       96.875
SET       7.839       97.031
SET       7.903       97.188
SET       7.967       97.344
SET       8.063       97.500
SET       8.159       97.656
SET       8.319       97.812
SET       8.447       97.969
SET       8.639       98.125
SET       8.959       98.281
SET       9.663       98.438
SET      10.175       98.516
SET      10.815       98.594
SET      11.263       98.672
SET      11.519       98.750
SET      11.647       98.828
SET      11.839       98.906
SET      11.967       98.984
SET      12.031       99.062
SET      12.159       99.141
SET      12.351       99.219
SET      12.415       99.258
SET      12.479       99.297
SET      12.543       99.336
SET      12.671       99.375
SET      12.735       99.414
SET      12.863       99.453
SET      12.991       99.492
SET      13.119       99.531
SET      13.311       99.570
SET      13.439       99.609
SET      13.567       99.629
SET      13.631       99.648
SET      13.759       99.668
SET      13.887       99.688
SET      14.079       99.707
SET      14.207       99.727
SET      14.463       99.746
SET      14.719       99.766
SET      15.039       99.785
SET      15.423       99.805
SET      15.615       99.814
SET      15.871       99.824
SET      16.127       99.834
SET      16.383       99.844
SET      16.767       99.854
SET      17.151       99.863
SET      17.535       99.873
SET      17.919       99.883
SET      18.303       99.893
SET      18.943       99.902
SET      19.199       99.907
SET      19.583       99.912
SET      19.839       99.917
SET      20.223       99.922
SET      20.607       99.927
SET      21.119       99.932
SET      21.759       99.937
SET      22.399       99.941
SET      23.295       99.946
SET      24.831       99.951
SET      25.855       99.954
SET      27.775       99.956
SET      29.183       99.958
SET      30.847       99.961
SET      34.815       99.963
SET      41.215       99.966
SET      52.991       99.968
SET      56.063       99.971
SET      60.671       99.973
SET      99.839       99.976
SET     102.399       99.977
SET     103.935       99.978
SET     104.959       99.979
SET     105.983       99.980
SET     107.519       99.982
SET     108.543       99.983
SET     109.567       99.984
SET     110.591       99.985
SET     112.127       99.987
SET     113.151       99.988
SET     114.175       99.988
SET     114.687       99.989
SET     115.711       99.990
SET     118.271       99.990
SET     121.855       99.991
SET     125.951       99.991
SET     130.047       99.992
SET     251.903       99.993
SET     254.975       99.993
SET     261.119       99.994
SET     264.191       99.994
SET     268.287       99.995
SET     272.383       99.995
SET     276.479       99.995
SET     282.623       99.995
SET     438.271       99.996
SET     444.415       99.996
SET     450.559       99.996
SET     456.703       99.997
SET     462.847       99.997
SET     466.943       99.997
SET     471.039       99.997
SET     473.087       99.997
SET     477.183       99.998
SET     481.279       99.998
SET     485.375       99.998
SET     489.471       99.998
SET     491.519       99.998
SET     497.663       99.998
SET     501.759       99.998
SET     505.855       99.999
SET     507.903       99.999
SET     509.951       99.999
SET     511.999       99.999
SET     514.047       99.999
SET     518.143       99.999
SET     520.191       99.999
SET     522.239       99.999
SET     524.287       99.999
SET     528.383       99.999
SET     528.383       99.999
SET     532.479       99.999
SET     532.479       99.999
SET     532.479       99.999
[...]
SET     536.575       99.999
SET     536.575      100.000
SET     540.671      100.000
SET     540.671      100.000
SET     544.767      100.000
SET     544.767      100.000
SET     544.767      100.000
[...]
SET     548.863      100.000
SET     548.863      100.000
SET     548.863      100.000
SET     552.959      100.000
SET     552.959      100.000
SET     557.055      100.000
SET     557.055      100.000
SET     557.055      100.000
SET     561.151      100.000
SET     561.151      100.000
SET     561.151      100.000
[...]
SET     565.247      100.000
SET     565.247      100.000
SET     565.247      100.000
[...]
SET     569.343      100.000
SET     569.343      100.000
SET     569.343      100.000
[...]
SET     573.439      100.000
SET     573.439      100.000
SET     573.439      100.000
[...]
SET     577.535      100.000
SET     577.535      100.000
SET     577.535      100.000
[...]
SET     581.631      100.000
SET     581.631      100.000
---
GET       0.247        0.000
GET       3.343        5.000
GET       3.455       10.000
GET       3.551       15.000
GET       3.631       20.000
GET       3.727       25.000
GET       3.823       30.000
GET       3.983       35.000
GET       4.351       40.000
GET       5.343       45.000
GET       5.599       50.000
GET       5.663       52.500
GET       5.727       55.000
GET       5.759       57.500
GET       5.823       60.000
GET       5.887       62.500
GET       5.919       65.000
GET       5.951       67.500
GET       6.015       70.000
GET       6.047       72.500
GET       6.079       75.000
GET       6.111       76.250
GET       6.143       77.500
GET       6.175       78.750
GET       6.207       80.000
GET       6.239       81.250
GET       6.271       82.500
GET       6.303       83.750
GET       6.367       85.000
GET       6.431       86.250
GET       6.463       87.500
GET       6.527       88.125
GET       6.559       88.750
GET       6.591       89.375
GET       6.655       90.000
GET       6.719       90.625
GET       6.783       91.250
GET       6.847       91.875
GET       6.943       92.500
GET       7.007       93.125
GET       7.103       93.750
GET       7.167       94.062
GET       7.199       94.375
GET       7.263       94.688
GET       7.327       95.000
GET       7.391       95.312
GET       7.455       95.625
GET       7.519       95.938
GET       7.615       96.250
GET       7.711       96.562
GET       7.775       96.875
GET       7.839       97.031
GET       7.871       97.188
GET       7.935       97.344
GET       8.031       97.500
GET       8.159       97.656
GET       8.255       97.812
GET       8.383       97.969
GET       8.511       98.125
GET       8.703       98.281
GET       9.215       98.438
GET       9.599       98.516
GET      10.431       98.594
GET      10.879       98.672
GET      11.263       98.750
GET      11.391       98.828
GET      11.583       98.906
GET      11.775       98.984
GET      11.839       99.062
GET      12.031       99.141
GET      12.159       99.219
GET      12.223       99.258
GET      12.287       99.297
GET      12.351       99.336
GET      12.351       99.375
GET      12.415       99.414
GET      12.607       99.453
GET      12.735       99.492
GET      12.863       99.531
GET      13.119       99.570
GET      13.183       99.609
GET      13.247       99.629
GET      13.503       99.648
GET      13.695       99.668
GET      13.951       99.688
GET      14.143       99.707
GET      14.527       99.727
GET      14.719       99.746
GET      14.911       99.766
GET      15.231       99.785
GET      15.551       99.805
GET      15.615       99.814
GET      16.319       99.824
GET      17.151       99.834
GET      17.279       99.844
GET      17.663       99.854
GET      17.791       99.863
GET      17.791       99.873
GET      17.919       99.883
GET      18.047       99.893
GET      18.559       99.902
GET      18.559       99.907
GET      18.687       99.912
GET      18.687       99.917
GET      21.247       99.922
GET      21.247       99.927
GET      21.247       99.932
GET      21.247       99.937
GET      21.247       99.941
GET      21.759       99.946
GET      21.759       99.951
GET      21.759       99.954
GET      22.783       99.956
GET      22.783       99.958
GET      22.783       99.961
GET      22.783       99.963
GET      23.039       99.966
GET      23.039       99.968
GET      23.039       99.971
GET      23.039       99.973
GET      23.039       99.976
GET      23.039       99.977
GET      50.943       99.978
GET      50.943       99.979
GET      50.943       99.980
GET      50.943       99.982
GET      50.943       99.983
GET      50.943       99.984
GET      50.943       99.985
GET      50.943       99.987
GET      50.943       99.988
GET      50.943       99.988
GET     102.399       99.989
GET     102.399      100.000
---
WAIT      0.000      100.000